#### Import արեք pandas գրադարանը pd  անունով

In [2]:
import pandas as pd

### Import the dataset baby_names.txt, assign it to a variable called baby_names

### Import արեք baby_names.txt dataset-ը ու այն վերագրեք baby_names փոփոխականի

In [8]:
baby_names = pd.read_csv('baby_names.csv')

### See the first 10 entries.

### Տպեք առաջին 10 արժեքը

In [9]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Delete the columns 'Unnamed: 0' and 'Id'

### Ջնջեք 'Unnamed: 0' ու 'Id' սյուները

In [10]:
# del baby_names["Id"] and del baby_names['Unnamed: 0']
baby_names = baby_names.drop(["Id", "Unnamed: 0"], axis = 'columns')

### Are there more male or female names in the dataset?

### Արդյոք dataset-ում ավելի շատ են կանացի թե տղամարդու անունները?

In [12]:
women_count = len(baby_names[baby_names["Gender"] == "F"])
men_count = len(baby_names[baby_names["Gender"] == "M"])
print("women ---", women_count,  " men ---", men_count)

women --- 2404  men --- 99

### Delete the column 'Year'. Group the dataset by name and assign to names.

### Ջնջեք 'Year' սյունը. Խմբավորեք dataset-ը ըստ անունի ու վերագրեք արդյունքը names փոփոխականին

In [31]:
del baby_names["Year"]
names = baby_names.groupby('Name')

### How many different names exist in the dataset?

### Քանի հատ տարբեր անուն կա dataset-ում?

In [32]:
unique_names = baby_names["Name"].unique()
print(len(unique_names))

575

### What is the name with most occurrences?

### Որն է ամենաշատ հանդիպող անունը?

In [72]:
baby_names.Name.value_counts()

Riley      12
Emma       11
Mia        11
Maya       11
Madison    11
           ..
Hanna       1
Scarlet     1
Ariella     1
Joanna      1
Trenton     1
Name: Name, Length: 575, dtype: int64

### What is the median name occurrence?

### Որն է անունների հանդիպման մեդիանը՞

In [63]:
baby_names.Name.value_counts().median()

3.0

### Get a summary with the mean, min, max, std and quartiles.

### Ստացեք dataset-ի ամփոփում mean, min, max, std ու quartile-ներով

In [64]:
baby_names.describe()

             Count
count  2503.000000
mean     11.485018
std       8.830294
min       5.000000
25%       6.000000
50%       8.000000
75%      13.000000
max      65.000000